<?php
return [
    'admin' => [
        'additives' =>[
            'created'=> [
                'success' => 'Наполнитель добавлен',
                'error' => 'Ошибка добавления наполнителя',
            ],
            'updated'=> [
                'success' => 'Наполнитель обновлен',
                'error' => 'Ошибка обновления наполнителя',
            ],
            'deleted'=> [
                'success' => 'Наполнитель удален',
                'error' => 'Ошибка удаления наполнителя',
            ]
        ],
        'binders' =>[
            'created'=> [
                'success' => 'Основание добавлено',
                'error' => 'Ошибка добавления основания',
            ],
            'updated'=> [
                'success' => 'Основание обновлено',
                'error' => 'Ошибка обновления основания',
            ],
            'deleted'=> [
                'success' => 'Основание удалено',
                'error' => 'Ошибка удаления основания',
            ]

        ],
        'brands' =>[
            'created'=> [
                'success' => 'Произволитель добавлен',
                'error' => 'Ошибка добавления производителя',
            ],
            'updated'=> [
                'success' => 'Производитель обновлен',
                'error' => 'Ошибка обновления производителя',
            ],
            'deleted'=> [
                'success' => 'Производитель удален',
                'error' => 'Ошибка удаления производителя',
            ]
        ],
        'catalogs' =>[
            'created'=> [
                'success' => 'Сегмент добавлен',
                'error' => 'Ошибка добавления сегмента',
            ],
            'updated'=> [
                'success' => 'Сегмент обновлен',
                'error' => 'Ошибка обновления сегмента',
            ],
            'deleted'=> [
                'success' => 'Сегмент удален',
                'error' => 'Ошибка удаления сегмента',
            ]
        ],
        'environments' =>[
            'created'=> [
                'success' => 'Среда эксплуатации добавлена',
                'error' => 'Ошибка добавления среды эксплуатации',
            ],
            'updated'=> [
                'success' => 'Среда эксплуатации обновлена',
                'error' => 'Ошибка обновления среды эксплуатации',
            ],
            'deleted'=> [
                'success' => 'Среда эксплуатации удалена',
                'error' => 'Ошибка удаления среды эксплуатации',
            ]
        ],
        'products' => [
            'created'=> [
                'success' => 'Материал добавлен',
                'error' => 'Ошибка добавления материала',
            ],
            'updated'=> [
                'success' => 'Материал обновлен',
                'error' => 'Ошибка обновления материала',
            ],
            'deleted'=> [
                'success' => 'Материал удален',
                'error' => 'Ошибка удаления материала',
            ],
            'parsed'=> [
                'success' => 'Записи из источников обновлены',
                'error' => 'Ошибка обновления записей из источника',
            ],
            'picture'=> [
                'success' => 'Загрузка изображения выполнена',
                'error' => 'Ошибка загрузки изображения',
            ],
        ],
        'numbers' => [
            'created'=> [
                'success' => 'Слой добавлен',
                'error' => 'Ошибка добавления слоя',
            ],
            'updated'=> [
                'success' => 'Слой обновлен',
                'error' => 'Ошибка обновления слоя',
            ],
            'deleted'=> [
                'success' => 'Слой удален',
                'error' => 'Ошибка удаления слоя',
            ],
        ],
        'feedbacks' =>[
            'created'=> [
                'success' => 'Отзыв добавлен',
                'error' => 'Ошибка добавления отзыва',
            ],
            'updated'=> [
                'success' => 'Отзыв обновлен',
                'error' => 'Ошибка обновления отзыва',
            ],
            'deleted'=> [
                'success' => 'Отзыв удален',
                'error' => 'Ошибка удаления отзыва',
            ]

        ],
        'users' =>[
            'created'=> [
                'success' => 'Пользователь добавлен',
                'error' => 'Ошибка добавления пользователя',
            ],
            'updated'=> [
                'success' => 'Данные пользователя обновлены',
                'error' => 'Ошибка обновления данных пользователя',
            ],
            'deleted'=> [
                'success' => 'Пользователь удален',
                'error' => 'Ошибка удаления пользователя',
            ]

        ],
        'resources' =>[
            'created'=> [
                'success' => 'Источник добавлен',
                'error' => 'Ошибка добавления источника',
            ],
            'updated'=> [
                'success' => 'Данные источника обновлены',
                'error' => 'Ошибка обновления данных источника',
            ],
            'deleted'=> [
                'success' => 'Источник удален',
                'error' => 'Ошибка удаления источника',
            ],

        ],
        'resistances' =>[
            'created'=> [
                'success' => 'Стойкость добавлена',
                'error' => 'Ошибка добавления стойкости',
            ],
            'updated'=> [
                'success' => 'Стойкость обновлена',
                'error' => 'Ошибка обновления стойкости',
            ],
            'deleted'=> [
                'success' => 'Стойкость удалена',
                'error' => 'Ошибка удаления стойкости',
            ],

        ],
        'substrates' =>[
            'created'=> [
                'success' => 'Подложка добавлена',
                'error' => 'Ошибка добавления подложки',
            ],
            'updated'=> [
                'success' => 'Подложка обновлена',
                'error' => 'Ошибка обновления подложки',
            ],
            'deleted'=> [
                'success' => 'Подложка удалена',
                'error' => 'Ошибка удаления подложки',
            ],

        ],
        'searches' =>[
            'created'=> [
                'success' => 'Поиск добавлен',
                'error' => 'Ошибка добавления поиска',
            ],
            'updated'=> [
                'success' => 'Поиск обновлен',
                'error' => 'Ошибка обновления поиска',
            ],
            'deleted'=> [
                'success' => 'Поиск удален',
                'error' => 'Ошибка удаления поиска',
            ],

        ],

    ],
    'subscription' =>[
        'created'=> [
            'success' => 'Подписка оформлена',
            'error' => 'Ошибка оформления подписки',
        ],
    ],
    'messages' =>[
        'created'=> [
            'success' => 'Ваше сообщение отправлено',
            'error' => 'Ошибка отправления сообщения',
        ],
    ],
    'searches' =>[
        'created'=> [
            'success' => 'Поиск произведен',
            'error' => 'Ошибка поиска',
            'empty'=> 'Задан поиск без параметров'
        ],
        'updated'=> [
            'success' => 'Параметры поиска обновлены',
            'error' => 'Ошибка обновления параметров поиска',
        ],
        'deleted'=> [
            'success' => 'Поиск удален',
            'error' => 'Ошибка удаления поиска',
        ],

    ],
    'account' => [
        'places' =>[
            'created'=> [
                'success' => 'Место добавлено',
                'error' => 'Ошибка добавления места',
            ],
            'updated'=> [
                'success' => 'Место обновлено',
                'error' => 'Ошибка обновления места',
            ],
            'deleted'=> [
                'success' => 'Место удалено',
                'error' => 'Ошибка удаления места',
            ],
            'parsed'=> [
                'success' => 'Парсинг места выполнен',
                'error' => 'Ошибка парсинга мест',
            ]
        ],
        'sources' =>[
            'created'=> [
                'success' => 'Источник добавлен',
                'error' => 'Ошибка добавления источника',
            ],
            'updated'=> [
                'success' => 'Источник обновлен',
                'error' => 'Ошибка обновления источника',
            ],
            'deleted'=> [
                'success' => 'Источник удален',
                'error' => 'Ошибка удаления источника',
            ]
        ],



    ]


];
